Revit 2026 API

# ViewConvertToIndependent Method

---

Convert the dependent view to independent.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ConvertToIndependent()
```
```vb
Public Sub ConvertToIndependent
```
```cpp
public:
void ConvertToIndependent()
```
```fsharp
member ConvertToIndependent : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This view is not dependent. |

This method can be only applied to a dependent view. A dependent view can be created from another view using method View.Duplicate(ViewDuplicateOption.AsDependent). Dependent views have a valid primary view element ID that can be obtained via method View.GetPrimaryViewId(); Independent views have InvalidElementId as their primary view ID.

#### Reference

View Class

Autodesk.Revit.DB Namespace